app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 03 Mar 2012 07:31:50 UTC +00:00], ["updated_at", Sat, 03 Mar 2012 07:31:50 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Mon, 05 Mar 2012 09:32:47 UTC +00:00], ["order_id", nil], ["product_id", 207281424], ["quantity", 1], ["updated_at", Mon, 05 Mar 2012 09:32:47 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-03-03 08:03:57.075770' WHERE "line_items"."id" = 2