app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc',
      per_page: 10

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 980190963
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 980190963
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 05 Mar 2012 11:51:19 UTC +00:00], ["updated_at", Mon, 05 Mar 2012 11:51:19 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "orders" SET "name" = 'happy', "updated_at" = '2012-03-05 06:33:05.218218' WHERE "orders"."id" = 1
---
  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])