app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "name" = 'sam', "password_digest" = '$2a$10$YT44stXwjxRbDi/Kv9gOC.hzNlla3hT8R29qx.FGDgUe9As6SenJi', "updated_at" = '2012-03-05 11:51:21.450461' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy